#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
tls_private_key.this: Refreshing state... [id=9f11121bd06689cad91bec939cc6fce4ce83738b]
tls_self_signed_cert.this: Refreshing state... [id=225337073805038127630726206987157184584]
aws_sns_topic.alert_sns_topic: Refreshing state... [id=arn:aws:sns:ca-central-1:122315759805:staging-hello-world]
aws_elastic_beanstalk_application.app: Refreshing state... [id=staging-hello-world]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:122315759805:certificate/5b28a154-14ae-41f5-9410-56293bb20e76]
aws_s3_bucket.dist_bucket: Refreshing state... [id=staging-elb-dist]
aws_iam_role.service: Refreshing state... [id=staging-eb-service]
aws_iam_role.ec2: Refreshing state... [id=staging-eb-ec2]
aws_cloudformation_stack.tf_sns_topic_subscription: Refreshing state... [id=arn:aws:cloudformation:ca-central-1:122315759805:stack/staging-snsStack/9ab9a040-ac36-11eb-bc1b-0e9e5871025e]
aws_iam_role_policy_attachment.service: Refreshing state... [id=staging-eb-service-20210503174008510700000001]
aws_iam_role_policy.default: Refreshing state... [id=staging-eb-ec2:staging-eb-default]
aws_iam_instance_profile.ec2: Refreshing state... [id=staging-eb-ec2]
aws_iam_role_policy_attachment.elastic_beanstalk_multi_container_docker: Refreshing state... [id=staging-eb-ec2-20210503174008519100000002]
aws_elastic_beanstalk_environment.this: Refreshing state... [id=e-pcifgv6dqh]
aws_s3_bucket_object.dist_item: Refreshing state... [id=staging/dist-53ca0d9b-42f0-eb90-4424-1bd3689bafca]
aws_elastic_beanstalk_application_version.this: Refreshing state... [id=staging-hello-world-f38b8255-9c88-98c9-5179-dc32b31a84d5]
aws_cloudwatch_metric_alarm.cpu[0]: Refreshing state... [id=staging-hello-world-cpu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_acm_certificate.this will be updated in-place
  ~ resource "aws_acm_certificate" "this" {
      + certificate_authority_arn = ""
        id                        = "arn:aws:acm:ca-central-1:122315759805:certificate/5b28a154-14ae-41f5-9410-56293bb20e76"
      # Warning: this attribute value will be marked as sensitive and will
      # not display in UI output after applying this change
      ~ private_key               = (sensitive value)
        tags                      = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_elastic_beanstalk_application_version.this must be replaced
-/+ resource "aws_elastic_beanstalk_application_version" "this" {
      ~ arn          = "arn:aws:elasticbeanstalk:ca-central-1:122315759805:applicationversion/staging-hello-world/staging-hello-world-f38b8255-9c88-98c9-5179-dc32b31a84d5" -> (known after apply)
      ~ id           = "staging-hello-world-f38b8255-9c88-98c9-5179-dc32b31a84d5" -> (known after apply)
      ~ key          = "staging/dist-53ca0d9b-42f0-eb90-4424-1bd3689bafca" -> (known after apply) # forces replacement
      ~ name         = "staging-hello-world-f38b8255-9c88-98c9-5179-dc32b31a84d5" -> (known after apply) # forces replacement
      - tags         = {} -> null
      ~ tags_all     = {} -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_elastic_beanstalk_environment.this will be updated in-place
  ~ resource "aws_elastic_beanstalk_environment" "this" {
        id                     = "e-pcifgv6dqh"
        name                   = "staging-hello-world"
        tags                   = {}
        # (18 unchanged attributes hidden)

      - setting {
          - name      = "BreachDuration" -> null
          - namespace = "aws:autoscaling:trigger" -> null
          - value     = "5" -> null
        }
      + setting {
          + name      = "BreachDuration"
          + namespace = "aws:autoscaling:trigger"
          + value     = "5"
        }
      - setting {
          - name      = "InstancePort" -> null
          - namespace = "aws:elb:listener:443" -> null
          - value     = "80" -> null
        }
      + setting {
          + name      = "InstancePort"
          + namespace = "aws:elb:listener:443"
          + value     = "80"
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener"
          + value     = "false"
        }
      - setting {
          - name      = "ListenerEnabled" -> null
          - namespace = "aws:elb:listener:443" -> null
          - value     = "true" -> null
        }
      + setting {
          + name      = "ListenerEnabled"
          + namespace = "aws:elb:listener:443"
          + value     = "true"
        }
      - setting {
          - name      = "ListenerProtocol" -> null
          - namespace = "aws:elb:listener:443" -> null
          - value     = "HTTPS" -> null
        }
      + setting {
          + name      = "ListenerProtocol"
          + namespace = "aws:elb:listener:443"
          + value     = "HTTPS"
        }
      - setting {
          - name      = "MaxSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "4" -> null
        }
      + setting {
          + name      = "MaxSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "4"
        }
      - setting {
          - name      = "MinSize" -> null
          - namespace = "aws:autoscaling:asg" -> null
          - value     = "1" -> null
        }
      + setting {
          + name      = "MinSize"
          + namespace = "aws:autoscaling:asg"
          + value     = "1"
        }
      - setting {
          - name      = "SSLCertificateId" -> null
          - namespace = "aws:elb:listener:443" -> null
          - value     = "arn:aws:acm:ca-central-1:122315759805:certificate/5b28a154-14ae-41f5-9410-56293bb20e76" -> null
        }
      + setting {
          + name      = "SSLCertificateId"
          + namespace = "aws:elb:listener:443"
          + value     = "arn:aws:acm:ca-central-1:122315759805:certificate/5b28a154-14ae-41f5-9410-56293bb20e76"
        }
        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_object.dist_item must be replaced
-/+ resource "aws_s3_bucket_object" "dist_item" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "62943479eb8cb8edf14d6eb563d094e2" -> (known after apply)
      ~ id                     = "staging/dist-53ca0d9b-42f0-eb90-4424-1bd3689bafca" -> (known after apply)
      ~ key                    = "staging/dist-53ca0d9b-42f0-eb90-4424-1bd3689bafca" -> (known after apply) # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      + server_side_encryption = (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      ~ tags_all               = {} -> (known after apply)
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # tls_self_signed_cert.this will be updated in-place
  ~ resource "tls_self_signed_cert" "this" {
        id                    = "225337073805038127630726206987157184584"
      # Warning: this attribute value will be marked as sensitive and will
      # not display in UI output after applying this change
      ~ private_key_pem       = (sensitive value)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

Changes to Outputs:
  ~ app_version = "staging-hello-world-f38b8255-9c88-98c9-5179-dc32b31a84d5" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.plan"

```
</details>
*Pusher: @davegallant, Action: `pull_request`*